Revit 2027 API
StairsRunType.NosingLength Property
 The amount of the tread depth that overhangs the next tread.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NosingLength { get; set; }
Public Property NosingLength As Double
	Get
	Set
public:
property double NosingLength {
	double get ();
	void set (double value);
}
member NosingLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for length must be between 0 and 30000 feet.
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace